In this chapter I discuss tools for missing data, duplicate data, string manipulation,
and some other analytical data transformations. In the next chapter, I focus on com‐
bining and rearranging datasets in various ways.

### 7.1 Handling Missing Data

In [2]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data[0] = None

In [10]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [11]:
from numpy import nan as NA

In [12]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [14]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

This is equivalent to:

In [15]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [17]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [18]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
cleaned = data.dropna()

In [20]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [21]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

To drop columns in the same way, pass axis=1 :

In [22]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
data[4] = NA

In [24]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [25]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [26]:
df = pd.DataFrame(np.random.randn(7, 3))

In [27]:
df

          0         1         2
0  1.046022  0.474650  0.219162
1  0.091754  0.027976 -1.225297
2  0.106679 -1.660845 -0.809706
3 -0.926391  1.760831  0.286097
4 -0.178163  0.645424  0.399280
5  0.027177  0.624831  3.027980
6 -2.079530  1.198893 -0.863168

In [28]:
df.iloc[:4,1] = NA

In [29]:
df.iloc[:2,2] = NA

In [30]:
df

          0         1         2
0  1.046022       NaN       NaN
1  0.091754       NaN       NaN
2  0.106679       NaN -0.809706
3 -0.926391       NaN  0.286097
4 -0.178163  0.645424  0.399280
5  0.027177  0.624831  3.027980
6 -2.079530  1.198893 -0.863168

In [31]:
df.dropna()

          0         1         2
4 -0.178163  0.645424  0.399280
5  0.027177  0.624831  3.027980
6 -2.079530  1.198893 -0.863168

In [32]:
df.dropna(thresh=2)

          0         1         2
2  0.106679       NaN -0.809706
3 -0.926391       NaN  0.286097
4 -0.178163  0.645424  0.399280
5  0.027177  0.624831  3.027980
6 -2.079530  1.198893 -0.863168

### Filling In Missing Data

In [33]:
df.fillna(0)

          0         1         2
0  1.046022  0.000000  0.000000
1  0.091754  0.000000  0.000000
2  0.106679  0.000000 -0.809706
3 -0.926391  0.000000  0.286097
4 -0.178163  0.645424  0.399280
5  0.027177  0.624831  3.027980
6 -2.079530  1.198893 -0.863168

In [34]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  1.046022  0.500000  0.000000
1  0.091754  0.500000  0.000000
2  0.106679  0.500000 -0.809706
3 -0.926391  0.500000  0.286097
4 -0.178163  0.645424  0.399280
5  0.027177  0.624831  3.027980
6 -2.079530  1.198893 -0.863168

fillna returns a new object, but you can modify the existing object in-place:

In [35]:
_ = df.fillna(0, inplace=True)

In [36]:
df

          0         1         2
0  1.046022  0.000000  0.000000
1  0.091754  0.000000  0.000000
2  0.106679  0.000000 -0.809706
3 -0.926391  0.000000  0.286097
4 -0.178163  0.645424  0.399280
5  0.027177  0.624831  3.027980
6 -2.079530  1.198893 -0.863168

In [37]:
df = pd.DataFrame(np.random.randn(6, 3))

In [38]:
df.iloc[2:, 1] = NA

In [39]:
df.iloc[4:, 2] = NA

In [40]:
df

          0         1         2
0  0.288951 -0.253220 -0.890537
1  0.776853  0.804617  0.252595
2  0.404516       NaN  1.637026
3  0.063433       NaN -1.010874
4 -1.014803       NaN       NaN
5  0.871835       NaN       NaN

In [41]:
df.fillna(method='ffill')

          0         1         2
0  0.288951 -0.253220 -0.890537
1  0.776853  0.804617  0.252595
2  0.404516  0.804617  1.637026
3  0.063433  0.804617 -1.010874
4 -1.014803  0.804617 -1.010874
5  0.871835  0.804617 -1.010874

In [42]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.288951 -0.253220 -0.890537
1  0.776853  0.804617  0.252595
2  0.404516  0.804617  1.637026
3  0.063433  0.804617 -1.010874
4 -1.014803       NaN -1.010874
5  0.871835       NaN -1.010874

In [43]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [44]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [46]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### 7.2 Data Transformation

So far in this chapter we’ve been concerned with rearranging data. Filtering, cleaning,
and other transformations are another class of important operations.

#### Removing Duplicates

In [47]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [48]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [49]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [50]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [51]:
data['v1'] = range(7)

In [52]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [53]:
data.drop_duplicates('k1')

    k1  k2  v1
0  one   1   0
1  two   1   1

In [54]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [55]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [56]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [57]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [58]:
lowercased = data['food'].str.lower()

In [59]:
data['food'] = lowercased

In [60]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [61]:
data['animal'] = lowercased.map(meat_to_animal)

In [62]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

We could also have passed a function that does all the work:

In [63]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [64]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [65]:
data.replace(-999,NA)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

If you want to replace multiple values at once, you instead pass a list and then the
substitute value:

In [66]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [68]:
data.replace([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [69]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [71]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [72]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [73]:
transform = lambda x: x[:4].upper()

In [74]:
transform

In [77]:
data.index = data.index.map(transform)

In [78]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

If you want to create a transformed version of a dataset without modifying the original, a useful method is rename :

In [79]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [80]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [81]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [82]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [83]:
bins = [18, 25, 35, 60, 100]

In [84]:
cats = pd.cut(ages,bins)

In [85]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [86]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [87]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [88]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [89]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [90]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [91]:
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [92]:
data = np.random.rand(20)

In [93]:
pd.cut(data, 4, precision=2)

[(0.73, 0.93], (0.52, 0.73], (0.31, 0.52], (0.31, 0.52], (0.52, 0.73], ..., (0.1, 0.31], (0.31, 0.52], (0.73, 0.93], (0.31, 0.52], (0.52, 0.73]]
Length: 20
Categories (4, interval[float64]): [(0.1, 0.31] < (0.31, 0.52] < (0.52, 0.73] < (0.73, 0.93]]

In [94]:
data = np.random.randn(1000) # normally distributed

In [95]:
cats = pd.qcut(data, 4) # cut into quartiles

In [96]:
cats

[(0.702, 3.526], (-3.26, -0.661], (0.702, 3.526], (-0.661, 0.0349], (0.702, 3.526], ..., (-3.26, -0.661], (0.0349, 0.702], (-0.661, 0.0349], (-3.26, -0.661], (-3.26, -0.661]]
Length: 1000
Categories (4, interval[float64]): [(-3.26, -0.661] < (-0.661, 0.0349] < (0.0349, 0.702] < (0.702, 3.526]]

In [97]:
pd.value_counts(cats)

(0.702, 3.526]      250
(0.0349, 0.702]     250
(-0.661, 0.0349]    250
(-3.26, -0.661]     250
dtype: int64

### Detecting and Filtering Outliers

In [98]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [99]:
data

            0         1         2         3
0   -0.662842 -0.899711 -0.946874 -1.706721
1    0.341500 -0.172187 -1.057046  0.173502
2    0.147782 -0.687486  0.548264  1.322136
3    0.135266  0.031946  0.353144 -1.352189
4   -0.309427  0.005888 -0.027327 -0.989673
..        ...       ...       ...       ...
995 -0.163357 -1.790516 -0.200596  0.763362
996  0.987678 -1.542227 -0.835055 -0.664544
997 -1.110351  1.608455 -0.807374 -0.307236
998 -0.101021  0.686387  1.801854  0.113646
999 -1.298714  0.946715  0.495841 -0.620418

[1000 rows x 4 columns]

In [100]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.003970    -0.001518    -0.049651     0.051468
std       0.980077     1.005933     0.976957     0.999857
min      -2.789347    -3.217874    -3.482136    -3.349490
25%      -0.616006    -0.687711    -0.691919    -0.650885
50%       0.007192     0.034904    -0.012518     0.112221
75%       0.692430     0.713324     0.563900     0.749634
max       3.118095     3.067303     2.934158     2.723409

In [101]:
col = data[2]

In [102]:
col

0     -0.946874
1     -1.057046
2      0.548264
3      0.353144
4     -0.027327
         ...
995   -0.200596
996   -0.835055
997   -0.807374
998    1.801854
999    0.495841
Name: 2, Length: 1000, dtype: float64

In [103]:
col[np.abs(col) > 3]

225   -3.482136
Name: 2, dtype: float64

In [104]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
59  -1.351903 -3.217874 -0.713942 -2.017071
225 -0.928625  0.788151 -3.482136 -1.582319
376 -0.094201  3.067303 -1.188867  0.241935
436  3.118095  0.356145 -0.086375 -1.110915
546  0.061164 -1.408304  0.744557 -3.349490
908  0.933549  0.421755  0.635784 -3.160147

In [105]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [106]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.003852    -0.001367    -0.049169     0.051977
std       0.979708     1.005056     0.975379     0.998225
min      -2.789347    -3.000000    -3.000000    -3.000000
25%      -0.616006    -0.687711    -0.691919    -0.650885
50%       0.007192     0.034904    -0.012518     0.112221
75%       0.692430     0.713324     0.563900     0.749634
max       3.000000     3.000000     2.934158     2.723409

In [109]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0 -1.0
1  1.0 -1.0 -1.0  1.0
2  1.0 -1.0  1.0  1.0
3  1.0  1.0  1.0 -1.0
4 -1.0  1.0 -1.0 -1.0

### Permutation and Random Sampling

In [110]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [111]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [112]:
sampler = np.random.permutation(5)

In [113]:
sampler

array([1, 4, 3, 2, 0])

In [114]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [115]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3

In [116]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3

In [117]:
choices = pd.Series([5, 7, -1, 6, 4])

In [118]:
draws = choices.sample(n=10, replace=True)

In [119]:
draws

2   -1
3    6
1    7
1    7
4    4
3    6
4    4
3    6
0    5
2   -1
dtype: int64

### Computing Indicator/Dummy Variables

In [120]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [121]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [122]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [123]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [124]:
df_with_dummy = df[['data1']].join(dummies)

In [125]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

    If a row in a DataFrame belongs to multiple categories, things are a bit more compli‐
cated. Let’s look at the MovieLens 1M dataset, which is investigated in more detail in
Chapter 14:

In [126]:
mnames = ['movie_id', 'title', 'genres']

In [127]:
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)

/home/talha/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/movielens/movies.dat'

### 7.3 String Manipulation

### String Object Methods

In [128]:
val = 'a,b, guido'

In [129]:
val.split(',')

['a', 'b', ' guido']

In [130]:
pieces = [x.strip() for x in val.split(',')]

In [131]:
pieces

['a', 'b', 'guido']

In [132]:
first, second, third = pieces

In [133]:
first + '::' + second + '::' + third

'a::b::guido'

In [134]:
'::'.join(pieces)

'a::b::guido'

In [135]:
'guido' in pieces

True

In [136]:
val.index(',')

1

In [137]:
val

'a,b, guido'

In [138]:
val.find(':')

-1

In [139]:
val.index(':')

ValueError: substring not found

In [140]:
val.count(',')

2

In [141]:
val.replace(',', '::')

'a::b:: guido'

In [142]:
val.replace(',', '')

'ab guido'

### Regular Expressions

In [143]:
import re

In [144]:
text = "foo bar\t baz \tqux"

In [146]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [147]:
regex = re.compile('\s+')

In [148]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [149]:
regex.findall(text)

[' ', '\t ', ' \t']

In [162]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [163]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [164]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [165]:
m = regex.search(text)

In [166]:
m

In [167]:
text[m.start():m.end()]

'dave@google.com'

In [168]:
print(regex.match(text))

None

In [169]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [170]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [171]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [172]:
m = regex.match('wesm@bright.net')

In [173]:
m.groups()

('wesm', 'bright', 'net')

In [174]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [175]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorized String Functions in pandas

In [176]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [177]:
data = pd.Series(data)

In [178]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [179]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [180]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [181]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [182]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [183]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [184]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [188]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!

In [189]:
matches.str[0]

AttributeError: Can only use .str accessor with string values!

In [190]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

#### 7.4 Conclusion
#### Effective data preparation can significantly improve productive by enabling you to
#### spend more time analyzing data and less time getting it ready for analysis. We have
#### explored a number of tools in this chapter, but the coverage here is by no means comprehensive. 
#### In the next chapter, we will explore pandas’s joining and grouping functionality.